create_clock -period 10.000 -name clk -waveform {0.000 5.000} -add [get_ports clk]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.200 [get_ports {data_in[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 0.500 [get_ports {data_in[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.200 [get_ports read_n]
set_input_delay -clock [get_clocks clk] -max -add_delay 0.500 [get_ports read_n]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.200 [get_ports reset]
set_input_delay -clock [get_clocks clk] -max -add_delay 0.500 [get_ports reset]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.200 [get_ports write_n]
set_input_delay -clock [get_clocks clk] -max -add_delay 0.500 [get_ports write_n]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.100 [get_ports {data_out[*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay 0.200 [get_ports {data_out[*]}]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.100 [get_ports empty]
set_output_delay -clock [get_clocks clk] -max -add_delay 0.200 [get_ports empty]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.100 [get_ports full]
set_output_delay -clock [get_clocks clk] -max -add_delay 0.200 [get_ports full]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.100 [get_ports invalid]
set_output_delay -clock [get_clocks clk] -max -add_delay 0.200 [get_ports invalid]

